espressif/esp-idf/components/soc/esp32c5/register/soc/cpu_apm_reg.h
/** CPU_APM_M1_STATUS_CLR_REG register
 *  CPU_APM_CTRL M1 status clear register
 */
#define CPU_APM_M1_STATUS_CLR_REG (DR_REG_CPU_APM_BASE + 0xdc)
/** CPU_APM_M1_EXCEPTION_STATUS_CLR : WT; bitpos: [0]; default: 0;
 *  Write 1 to clear exception status.
 */
#define CPU_APM_M1_EXCEPTION_STATUS_CLR    (BIT(0))
#define CPU_APM_M1_EXCEPTION_STATUS_CLR_M  (CPU_APM_M1_EXCEPTION_STATUS_CLR_V << CPU_APM_M1_EXCEPTION_STATUS_CLR_S)
#define CPU_APM_M1_EXCEPTION_STATUS_CLR_V  0x00000001U
#define CPU_APM_M1_EXCEPTION_STATUS_CLR_S  0

/** CPU_APM_M1_EXCEPTION_INFO0_REG register
 *  CPU_APM_CTRL M1 exception information register
 */
#define CPU_APM_M1_EXCEPTION_INFO0_REG (DR_REG_CPU_APM_BASE + 0xe0)
/** CPU_APM_M1_EXCEPTION_REGION : RO; bitpos: [15:0]; default: 0;
 *  Represents the region where an exception occurs.
 */
#define CPU_APM_M1_EXCEPTION_REGION    0x0000FFFFU
#define CPU_APM_M1_EXCEPTION_REGION_M  (CPU_APM_M1_EXCEPTION_REGION_V << CPU_APM_M1_EXCEPTION_REGION_S)
#define CPU_APM_M1_EXCEPTION_REGION_V  0x0000FFFFU
#define CPU_APM_M1_EXCEPTION_REGION_S  0
/** CPU_APM_M1_EXCEPTION_MODE : RO; bitpos: [17:16]; default: 0;
 *  Represents the master's security mode when an exception occurs.
 */
#define CPU_APM_M1_EXCEPTION_MODE    0x00000003U
#define CPU_APM_M1_EXCEPTION_MODE_M  (CPU_APM_M1_EXCEPTION_MODE_V << CPU_APM_M1_EXCEPTION_MODE_S)
#define CPU_APM_M1_EXCEPTION_MODE_V  0x00000003U
#define CPU_APM_M1_EXCEPTION_MODE_S  16
/** CPU_APM_M1_EXCEPTION_ID : RO; bitpos: [22:18]; default: 0;
 *  Represents master ID when an exception occurs.
 */
#define CPU_APM_M1_EXCEPTION_ID    0x0000001FU
#define CPU_APM_M1_EXCEPTION_ID_M  (CPU_APM_M1_EXCEPTION_ID_V << CPU_APM_M1_EXCEPTION_ID_S)
#define CPU_APM_M1_EXCEPTION_ID_V  0x0000001FU
#define CPU_APM_M1_EXCEPTION_ID_S  18

/** CPU_APM_M1_EXCEPTION_INFO1_REG register
 *  CPU_APM_CTRL M1 exception information register
 */
#define CPU_APM_M1_EXCEPTION_INFO1_REG (DR_REG_CPU_APM_BASE + 0xe4)
/** CPU_APM_M1_EXCEPTION_ADDR : RO; bitpos: [31:0]; default: 0;
 *  Represents the access address when an exception occurs.
 */
#define CPU_APM_M1_EXCEPTION_ADDR    0xFFFFFFFFU
#define CPU_APM_M1_EXCEPTION_ADDR_M  (CPU_APM_M1_EXCEPTION_ADDR_V << CPU_APM_M1_EXCEPTION_ADDR_S)
#define CPU_APM_M1_EXCEPTION_ADDR_V  0xFFFFFFFFU
#define CPU_APM_M1_EXCEPTION_ADDR_S  0

/** CPU_APM_INT_EN_REG register
 *  CPU_APM_CTRL M0/1 interrupt enable register
 */
#define CPU_APM_INT_EN_REG (DR_REG_CPU_APM_BASE + 0x118)
/** CPU_APM_M0_APM_INT_EN : R/W; bitpos: [0]; default: 0;
 *  Configures whether to enable CPU_APM_CTRL M0 interrupt.
 *  0: Disable
 *  1: Enable
 */
#define CPU_APM_M0_APM_INT_EN    (BIT(0))
#define CPU_APM_M0_APM_INT_EN_M  (CPU_APM_M0_APM_INT_EN_V << CPU_APM_M0_APM_INT_EN_S)
#define CPU_APM_M0_APM_INT_EN_V  0x00000001U
#define CPU_APM_M0_APM_INT_EN_S  0
/** CPU_APM_M1_APM_INT_EN : R/W; bitpos: [1]; default: 0;
 *  Configures whether to enable CPU_APM_CTRL M1 interrupt.
 *  0: Disable
 *  1: Enable
 */
#define CPU_APM_M1_APM_INT_EN    (BIT(1))
#define CPU_APM_M1_APM_INT_EN_M  (CPU_APM_M1_APM_INT_EN_V << CPU_APM_M1_APM_INT_EN_S)
#define CPU_APM_M1_APM_INT_EN_V  0x00000001U
#define CPU_APM_M1_APM_INT_EN_S  1

/** CPU_APM_CLOCK_GATE_REG register
 *  Clock gating register
 */
#define CPU_APM_CLOCK_GATE_REG (DR_REG_CPU_APM_BASE + 0x7f8)
/** CPU_APM_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Configures whether to keep the clock always on.
 *  0: Enable automatic clock gating
 *  1: Keep the clock always on
 */
#define CPU_APM_CLK_EN    (BIT(0))
#define CPU_APM_CLK_EN_M  (CPU_APM_CLK_EN_V << CPU_APM_CLK_EN_S)
#define CPU_APM_CLK_EN_V  0x00000001U
#define CPU_APM_CLK_EN_S  0

/** CPU_APM_DATE_REG register
 *  Version control register
 */
#define CPU_APM_DATE_REG (DR_REG_CPU_APM_BASE + 0x7fc)
/** CPU_APM_DATE : R/W; bitpos: [27:0]; default: 37769360;
 *  Version control register.
 */
#define CPU_APM_DATE    0x0FFFFFFFU
#define CPU_APM_DATE_M  (CPU_APM_DATE_V << CPU_APM_DATE_S)
#define CPU_APM_DATE_V  0x0FFFFFFFU
#define CPU_APM_DATE_S  0

#ifdef __cplusplus
}
#endif
